app/controllers/sessions_controller.rb

    def create

        current_id=params[:user][:user_id]
        current_email=params[:user][:email]
        current_user=User.find_by user_id: current_id
---
SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "ty"]]