app/controllers/users_controller.rb

  def create
   if((User.find_by user_id: params[:user][:user_id])==nil)
    @user = User.create_user!(params)
---
SELECT  "users".* FROM "users" WHERE "users"."user_id" = ? LIMIT 1  [["user_id", "f"]]
INSERT INTO "users" ("user_id", "email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "tysonm"], ["email", "ty@aol.com"], ["session_token", "I8RDRkwcJbTK1V+61ya+pA=="], ["created_at", "2015-10-04 04:49:07.207914"], ["updated_at", "2015-10-04 04:49:07.207914"]]